app/controllers/api/events_controller.rb

    def index
      render json: Event.order(sort_by + ' ' + order)
---
SELECT "events".* FROM "events" ORDER BY description desc

    def search
  		query = params[:query]
  		events = Event.where('name LIKE ?',
                       		 "%#{query}%")
---
SELECT "events".* FROM "events" WHERE (title LIKE '%3%')

    def create
      event = Event.new(event_params)
      if event.save
---
INSERT INTO "events" ("name", "event_date", "description", "priority", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Todo list React on Rails"], ["event_date", Sun, 31 Dec 2017], ["description", "44"], ["priority", 2], ["created_at", 2017-05-05 14:07:39 UTC], ["updated_at", 2017-05-05 14:07:39 UTC]]

    def update
      if @event.update(event_params)
---
UPDATE "events" SET "name" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["name", "Todo list React on Rails"], ["updated_at", 2017-05-05 14:08:38 UTC], ["id", 1]]

    def complete
      @event.update_attributes(complited: true)
---
UPDATE "events" SET "complited" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["complited", true], ["updated_at", 2017-05-08 14:58:03 UTC], ["id", 25]]